cybercrm/app/controllers/sessions_controller.rb

  def create
    auth = request.env['omniauth.auth']
    Rails.logger.debug { "OmniAuth data: #{auth.inspect}" }

    unless auth
      redirect_to pages_failure_path, alert: 'Authentication failed. Please try again.'
      return
    end

    user = User.from_omniauth(auth)
    array = ['willtaaa@tamu.edu', 'noamgariani@tamu.edu', 'pcr@tamu.edu', 'john.romero@tamu.edu',
             'pcannell512@tamu.edu', 'matthewatanas@tamu.edu', 'chrisvmuniz@tamu.edu']

    unless array.any? { |token| user.email.include?(token) }
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."id" != $2 LIMIT $3  [["email", "willtaaa@tamu.edu"], ["id", 1], ["LIMIT", 1]]